create database JUDY手搖飲料價目表
go

use JUDY手搖飲料價目表
go

drop table 絕品好茶區
go

CREATE TABLE 絕品好茶區
(
     絕品好茶區 varchar(255),
     大杯價格 varchar(255),
     中杯價格 varchar(255),
     內容物 varchar(255),
     熱量 varchar(255) 
);

select * from 絕品好茶區

insert into 絕品好茶區(絕品好茶區, 大杯價格, 中杯價格, 內容物, 熱量)
VALUES ('招牌紅茶',25,20,'大吉嶺','0卡/100g' ),
        ('招牌綠茶',25, 20,'茉香','0卡/100g' ),
 		('冠軍青茶',25,20,'高山青','0卡/100g' ),
 		('古早味冬瓜茶',25,20,'冬瓜','20卡/100g' ),
		('仙草甘茶',50,35,'老仙草干','11.5卡/100g');

select * from 絕品好茶區


create table 特調飲品區
(
     特調飲品區 varchar(255),
     大杯價格 varchar(255),
     中杯價格 varchar(255),
     內容物 varchar(255),
     熱量 varchar(255) 
);

select * from 特調飲品區

insert into 特調飲品區 (特調飲品區, 大杯價格, 中杯價格, 內容物, 熱量)
values ('梅子紅/綠',35,25,'梅子','20卡/100g' ),
        ('話梅紅/綠',35,25,'話梅','20卡/100g' ),
 		('多多紅/綠',50,40,'養樂多','25卡/100g' ),
 		('蜂蜜紅/綠',40,30,'蜂蜜','20卡/100g' ),
		('百香紅/綠',40,30,'百香果','20卡/100g'),
		('百香QQ果',40,30,'百香果、QQ','25卡/100g' ),
		('蜂蜜蘆薈',45,30,'蜂密加蘆薈','20卡/100g' ),
		('薄荷綠茶',40,30,'薄荷葉','10卡/100g' ),
		('冬瓜仙草凍',40,30,'冬瓜加仙草凍','35卡/100g' ),
		('布丁豆花',40,30,'布丁口感的豆花','30卡/100g' ),
		('特調咖啡',45,35,'加糖加奶咖啡','25卡/100g' );

select * from 特調飲品區

create table 醇品奶茶區
( 
 醇品奶茶區 varchar(255),
 大杯價格 varchar(255),
 中杯價格 varchar(255),
 內容物 varchar(255),
 熱量 varchar(255) 
);

select * from 醇品奶茶區

insert into 醇品奶茶區(醇品奶茶區,大杯價格,中杯價格,內容物,熱量)
values ('珍珠奶茶',40,30,'波霸珍珠','45卡/100g' ),
        ('青蛙撞奶',45,35,'粉圓加綠豆加鮮奶','45卡/100g' ),
 		('仙草奶凍',40,30,'仙草凍加鮮奶','40卡/100g' ),
 		('冬瓜鮮奶',45,35,'冬瓜加鮮奶','35卡/100g' ),
		('椰果奶茶',40,30,'椰果加奶茶','35卡/100g'),
		('布丁奶茶',40,30,'布丁加奶茶','35卡/100g' ),
		('仙草奶茶',40,30,'仙草加奶茶','30卡/100g' ),
		('烏龍奶茶',40,30,'烏龍茶加奶精','25卡/100g' ),
		('茉香綠奶',40,30,'茉香綠茶加奶精','25卡/100g' ),
		('蜂蜜奶茶',45,35,'蜂蜜加奶茶','30卡/100g' ),
		('薄荷奶茶',45,35,'薄荷加奶茶','25卡/100g' ),
		('芋香奶茶',45,35,'芋泥加奶茶','20卡/100g' ),
		('巧克力奶茶',60,45,'巧克力加奶茶','10卡/100g' ),
		('紅茶拿鐵',50,40,'紅茶加鮮奶','35卡/100g' ),
		('紅豆拿鐵',55,45,'紅豆加鮮奶','25卡/100g' ),
		('烏龍拿鐵',50,40,'烏龍加鮮奶','20卡/100g' ),
		('奶茶三姊妹',45,35,'珍加布加仙','10卡/100g' ),
		('奶茶三兄弟',45,35,'珍加椰加蒟','35卡/100g' ),
		('阿里山金萱',35,30,'阿里山茶葉','0卡/100g' );

select * from 醇品奶茶區

create table 新鮮水果區
( 
 新鮮水果區 varchar(255),
 大杯價格 varchar(255),
 中杯價格 varchar(255),
 內容物 varchar(255),
 熱量 varchar(255) 
);

select * from 新鮮水果區

insert into 新鮮水果區 (新鮮水果區, 大杯價格, 中杯價格, 內容物, 熱量)
values ('新鮮芒果汁',65,50,'愛文芒果','40卡/100g' ),
        ('芒果牛奶',70,60,'愛文芒果加光泉鮮奶','45卡/100g' ),
 		('金桔檸檬',55,45,'金桔加檸檬汁','52卡/100g' ),
 		('西瓜汁',50,35,'西瓜','20卡/100g' ),
		('綜合果汁',70,55,'蘋果加奇異果加自選水果','35卡/100g'),
		('奇異果汁',70,55,'奇異果','25卡/100g' ),
		('木瓜牛奶',70,55,'木瓜加光泉鮮奶','35卡/100g' ),
		('蘋果牛奶',70,55,'蘋果加光泉鮮奶','25卡/100g' ),
		('香蕉牛奶',70,55,'香蕉加光泉鮮奶','40卡/100g' ),
		('鳳梨蘋果汁',70,55,'鳳梨加蘋果','30卡/100g' ),
		('酪梨布丁牛奶',70,55,'酪梨加布丁加光泉鮮奶','55卡/100g' ),
		('柳丁原汁',70,55,'柳丁','20卡/100g' );

select * from 新鮮水果區

create table 鮮果特調區
(
 鮮果特調區 varchar(255),
 大杯價格 varchar(255),
 中杯價格 varchar(255),
 內容物 varchar(255),
 熱量 varchar(255) 
);

select * from 鮮果特調區

insert into 鮮果特調區 (鮮果特調區, 大杯價格, 中杯價格, 內容物, 熱量)
values ('香橙柳紅/綠',60,50,'橙加柳丁','20卡/100g' ),
        ('葡萄柚紅/綠',60,50,'葡萄柚','20卡/100g' ),
 		('鮮百香綠茶',50,40,'百香果','20卡/100g' ),
 		('鮮百香多多',60,50,'百香果加養樂多','35卡/100g' ),
		('鮮百香QQ果',50,40,'百香果加QQ','30卡/100g'),
		('檸檬綠茶',45,35,'檸檬加茉綠','10卡/100g' ),
		('冬瓜檸檬',45,35,'冬瓜加檸檬','35卡/100g' ),
		('檸檬蘆薈',50,40,'檸檬加蘆薈','25卡/100g' ),
		('檸檬話梅',45,35,'檸檬加話梅','20卡/100g' ),
		('檸檬汁',45,35,'檸檬','20卡/100g' ),
		('檸檬多多',60,50,'檸檬加養樂多','40卡/100g' ),
		('蜂蜜檸檬',50,40,'蜂蜜加檸檬','30卡/100g' );


select * from 鮮果特調區

create table 透涼冰沙區
(
 透涼冰沙區 varchar(255),
 大杯價格 varchar(255),
 中杯價格 varchar(255),
 內容物 varchar(255),
 熱量 varchar(255) 
);

select * from 透涼冰沙區

insert into 透涼冰沙區 (透涼冰沙區, 大杯價格, 中杯價格, 內容物, 熱量)
values ('招牌芒果沙',60,45,'愛文芒果','100卡/100g' ),
        ('綠豆沙',40,30,'綠豆沙','80卡/100g' ),
 		('綠豆沙牛奶',50,35,'綠豆沙加光泉牛奶','85卡/100g' ),
 		('百香果沙',40,30,'百香果沙','90卡/100g' ),
		('鳳梨沙',40,30,'鳳梨沙','90卡/100g'),
		('梅子沙',40,30,'梅子沙','80卡/100g' ),
		('情人果沙',40,30,'情人果沙','95卡/100g' ),
		('檸檬沙',40,30,'檸檬沙','70卡/100g' ),
		('火龍果沙',50,40,'火龍果沙','70卡/100g' ),
		('多多冰沙',50,40,'養樂多冰沙','95卡/100g' ),
		('巧克力冰沙',50,40,'巧克力冰沙','110卡/100g' ),
		('咖啡冰沙',50,40,'咖啡冰沙','100卡/100g' );

select * from 透涼冰沙區

create table 季節甜品區
(
 季節甜品區 varchar(255),
 大杯價格 varchar(255),
 中杯價格 varchar(255),
 內容物 varchar(255),
 熱量 varchar(255) 
);

select * from 季節甜品區

insert into 季節甜品區 (季節甜品區, 大杯價格, 中杯價格, 內容物, 熱量)
values ('燒仙草',50,40,'三種料','150卡/100g' ),
        ('紅豆湯',50,40,'紅豆、黑糖','150卡/100g' ),
 		('紅豆湯圓',55,45,'紅豆、黑糖、湯圓','200卡/100g' ),
 		('紅豆芋圓',55,45,'紅豆、黑糖、芋圓','200卡/100g' ),
		('薑母茶',40,30,'老薑黑糖','100卡/100g'),
		('桂圓湯',40,35,'桂圓加黑糖','120卡/100g' ),
		('桂圓薑母',40,35,'桂圓加老薑黑糖','125卡/100g' ),
		('原味冷/熱豆花',40,30,'豆花加2、3種料','120卡/100g' ),
		('薑汁熱豆花',45,35,'薑汁黑糖豆花加2、3種料','125卡/100g');

select * from 季節甜品區

select * from 醇品奶茶區

Delete from 醇品奶茶區
Where 醇品奶茶區='阿里山金萱';

select * from 醇品奶茶區

insert into 絕品好茶區(絕品好茶區, 大杯價格, 中杯價格, 內容物, 熱量)
VALUES ('阿里山金萱',35,30,'阿里山茶葉','0卡/100g' );

select * from 絕品好茶區

update 絕品好茶區
set 大杯價格=45
where 絕品好茶區='仙草甘茶'

select * from 絕品好茶區

USE JUDY手搖飲料價目表
SELECT *
FROM 絕品好茶區
WHERE 絕品好茶區 IN ('招牌紅茶','招牌綠茶')
GO

USE JUDY手搖飲料價目表
SELECT *
FROM 醇品奶茶區
WHERE 大杯價格 BETWEEN 45 AND 55
GO

USE JUDY手搖飲料價目表
SELECT *
FROM 醇品奶茶區
ORDER BY 中杯價格 ASC
GO

select * from 醇品奶茶區

insert into 絕品好茶區(絕品好茶區, 大杯價格, 中杯價格, 內容物, 熱量)
VALUES ('招牌紅茶',25,20,'大吉嶺','0卡/100g' );

select * from 絕品好茶區

USE JUDY手搖飲料價目表
SELECT DISTINCT 絕品好茶區
FROM 絕品好茶區

select * from 絕品好茶區

DELETE FROM 絕品好茶區
WHERE 絕品好茶區='招牌紅茶'

select * from 絕品好茶區

insert into 絕品好茶區(絕品好茶區, 大杯價格, 中杯價格, 內容物, 熱量)
VALUES ('招牌紅茶',25,20,'大吉嶺','0卡/100g' );

select * from 絕品好茶區

USE JUDY手搖飲料價目表
SELECT 絕品好茶區 AS 極品好茶區
FROM 絕品好茶區
GO

select * from 絕品好茶區

USE JUDY手搖飲料價目表
SELECT 絕品好茶區 AS 極品好茶區, (大杯價格*2) AS 特大杯價格
FROM 絕品好茶區
WHERE (大杯價格*2)<65
GO

select * from 絕品好茶區

ALTER TABLE 絕品好茶區
ADD DATELINE DATE 

select * from 絕品好茶區

ALTER TABLE 絕品好茶區
DROP COLUMN  DATELINE 

select * from 絕品好茶區

declare @大杯價格 INT=25
if @大杯價格> 25
begin
  print 'OK，我買了'
end
else
begin
  print 'NO，我不要了'
end























 